#+TITLE:icons-in-terminal successful setup
Last update at: [2023-01-26 Thu 15:36]
* MacOS
   MacOS might have overridden some unix system calls that checks font list.
   One will need to install the patched font again with Apple's /Font Book/
   in order for applications like =kitty= to pick it up.

   #+begin_src sh :results vector
   echo
   echo count type value comment
   echo
   fc-list -v | grep icons-in-terminal | sort -V | uniq -c | sed 's/"/'\''/g' | sed -E 's/^ +//' | sed -E 's/[^a-zA-Z0-9./:()-]+/|/g' | sort
   echo
   #+end_src

   #+RESULTS:
   |-------+-----------------+-----------------------------------------------+---------|
   | count | type            | value                                         | comment |
   |-------+-----------------+-----------------------------------------------+---------|
   |     1 | family:         | icons-in-terminal                             | (s)     |
   |     1 | file:           | =${HOME}/.fonts/icons-in-terminal.ttf=          | (s)     |
   |     1 | fullname:       | icons-in-terminal                             | (s)     |
   |     1 | postscriptname: | icons-in-terminal                             | (s)     |
   |-------+-----------------+-----------------------------------------------+---------|

   open the =ttf= file to install.

   #+begin_src sh
   # try xdg-open for linux if you have it
   open ${HOME}/.fonts/icons-in-terminal.ttf
   #+end_src

   #+RESULTS:

